Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Enables (default) or disables the Cloud Event support. If enabled on an _incoming_ channel, the connector analyzes the incoming records and try to create Cloud Event metadata. If enabled on an _outgoing_, the connector sends the outgoing messages as Cloud Event if the message includes Cloud Event Metadata. Type: _boolean_
zh_cn: 启用（默认）或禁用云事件支持。如果在 _incoming_ 通道上启用了，则连接器会分析传入记录并尝试创建云事件元数据。如果在 _outgoing_ 通道上启用了，如果消息包括云事件元数据，则连接器会将传出消息作为云事件发送。 类型: _boolean_

source: Enabling / Disabling Dev Services for AMQP
zh_cn: 启用/禁用AMQP的开发服务

source: Enabling / Disabling Dev Services for Apicurio Registry
zh_cn: 启用/禁用Apicurio注册表的开发服务

source: Enabling / Disabling Dev Services for Kafka
zh_cn: 启用/禁用Kafka开发服务

source: Enabling YAML Configuration
zh_cn: 启用YAML配置

source: Enabling transactions
zh_cn: 启用事务

source: Enrichment via QuarkusTest*Callback
zh_cn: 通过QuarkusTest*Callback来增强

source: Ensure that the response contains `count`
zh_cn: 确保响应中包含 `count`

source: Ensure that the value of the `auth-mechanism` property matches the authentication scheme supported by `HttpAuthenticationMechanism`, for example, `basic`, `bearer`, or `form`.
zh_cn: `auth-mechanism` 属性值必须与 HttpAuthenticationMechanism 支持的认证方案相匹配，如 `basic` 或 `bearer` 或 `form` 等等。

source: Ensure that you review and update the suppression list regularly to ensure that the results are up to date. You can optionally apply a time limit to individual suppressions by adding an expiry attribute, as outlined in the following example:
zh_cn: 确保您会检查和更新这个suppression列表以保证结果是及时更新的。 您可以选择通过添加过期属性来对单个的suppression项目应用一个时间限制，如下面所示：

source: Ensure the following dependency is present in your build file if you require the MicroProfile Metrics API:
zh_cn: 如果您需要使用MicroProfile Metrics API，请确保您的构建文件中存在以下依赖：

source: Enterprise support provided by Red Hat for the product.
zh_cn: 该产品由红帽公司提供企业级支持。

source: Entry point for everything gRPC.
zh_cn: 一切gRPC的总入口。

source: Environment Variables - `AWS_ACCESS_KEY_ID` and `AWS_SECRET_ACCESS_KEY`
zh_cn: 环境变量 - `AWS_ACCESS_KEY_ID` 和 `AWS_SECRET_ACCESS_KEY`

source: Error Handling Strategies
zh_cn: 错误处理策略(Error Handling Strategies)

source: Error handling for the exactly-once processing
zh_cn: （exactly-once）精确一次处理的错误处理

source: Essentially, any `QuarkusTestProfile` with at least one matching tag matching the value of `quarkus.test.profile.tags` will be considered active and all the tests annotated with `@TestProfile` of active profiles, will be run while the rest will be skipped. This is best shown in the following example.
zh_cn: 本质上，任何至少有一个标签与 `quarkus.test.profile.tags` 的值相匹配的 `QuarkusTestProfile` 将被认为是激活的，并且所有被激活的profiles中注解了 `@TestProfile` 的测试将被运行，而其余的将被跳过。这在下面的例子中得到了最好的体现。

source: Events
zh_cn: 活动

source: Every contribution is valuable. It can be a bug report, an example application, a feature request, a fix in the documentation or just feedback.
zh_cn: 每一份贡献都是有价值的。它可以是bug报告、示例应用程序、功能请求、文档中的修复或仅仅是反馈。

source: Every query operation accepts passing parameters by index (`Object...`), or by name (`Map<String,Object>` or `Parameters`).
zh_cn: 每个查询操作都接受按索引（ `Object...` ）或按名称（ `Map<String,Object>` 或 `Parameters` ）传递参数。

source: Everything described here will only work in the context of Quarkus extensions, it won't work in an application.
zh_cn: 这里描述的一切只在Quarkus扩展的范围内起作用，在应用程序中不会起作用。

source: Everything under the `"%test"` key is only enabled when the `test` profile is active. For example, in the previous snippet it disables OIDC (`quarkus.oidc.enabled: false`), whereas without the `test` profile, it would be enabled.
zh_cn: 只有当 `test` 环境配置处于激活状态时， `"%test"` 键下的所有内容才会被启用。例如在前面的代码片段中，它禁用了OIDC ( `quarkus.oidc.enabled: false` )，反之，如果没有 `test` 环境配置，它将会被启用。

source: Exactly-Once Processing
zh_cn: （Exactly-Once Processing）精确一次处理

source: Examine sam.yaml
zh_cn: 检查sam.yaml

source: Examine the JAX-RS resource
zh_cn: 检查JAX-RS资源

source: Examine the POM
zh_cn: 检查POM

source: Examine the POM and Gradle build
zh_cn: 检查POM和Gradle构建

source: Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
zh_cn: 如果你想了解执行了哪些aws命令来创建、删除和更新lambdas，请检查 `manage.sh` 脚本的输出。

source: Example
zh_cn: 例子

source: Example Gradle dependencies:
zh_cn: Gradle依赖项示例：

source: Example configuration:
zh_cn: 配置示例：

source: Example of usage
zh_cn: 使用示例

source: Example:
zh_cn: 例如：

source: Excellent, we have not provided any JWT in the request, so we should not be able to access the endpoint, and we were not. Instead, we received an HTTP 401 Unauthorized error. We need to obtain and pass in a valid JWT to access that endpoint. There are two steps to this, 1) configuring our {extension-name} extension with information on how to validate a JWT, and 2) generating a matching JWT with the appropriate claims.
zh_cn: 很好，我们在请求中没有提供任何JWT，所以我们应该不能够访问这个端点，而我们确实没有。相反，我们收到了一个HTTP 401 Unauthorized错误。我们需要获得并传入一个有效的JWT来访问该端点。这有两个步骤，1）用如何验证JWT的信息配置我们的{extension-name}扩展；2）用适当的声明(claim)生成一个匹配的JWT。

source: Excluding tests when running as a native executable
zh_cn: 作为原生可执行文件运行时排除测试

source: Execute: gradle wrapper to setup the gradle wrapper (recommended).
zh_cn: 执行：gradle wrapper来设置gradle wrapper（推荐）。

source: Executing against a running application
zh_cn: 对正在运行的应用程序执行测试

source: Execution model
zh_cn: 执行模型

source: Execution model and Blocking processing
zh_cn: 执行模型和阻塞处理

source: Expiration grace in seconds. By default, an expired token will still be accepted if the current time is no more than 1 min after the token expiry time.
zh_cn: 过期时间，以秒为单位。默认情况下，如果当前时间不超过令牌过期时间1分钟，过期的令牌仍将被接受。

source: Explore all the BuildItems you can consume/produce in your extensions.
zh_cn: 探索你可以在你的扩展中消费/提供的所有BuildItems。

source: Explore in more details how to debug native executables.
zh_cn: 更详细地探讨如何调试原生可执行文件。

source: Explore the Quarkus developer toolchain which makes Quarkus development so fast and enjoyable.
zh_cn: 探索Quarkus开发者工具链，让Quarkus开发如此快速和愉快。

source: Explore the Solution
zh_cn: 探索解决方案

source: Explore the wide breadth of technologies Quarkus with which applications can be made.
zh_cn: 探索Quarkus可以应用的广泛的技术。

source: Expressions
zh_cn: 表达式

source: Extend and customize the Configuration.
zh_cn: 扩展和定制配置。

source: Extending Configuration Support
zh_cn: 扩展配置支持

source: Extending the image
zh_cn: 扩展该镜像

source: Extension
zh_cn: 扩展

source: Extension Documentation
zh_cn: 扩展文档

source: Extension Repository
zh_cn: 扩展版本库

source: Extension Title Quarkiverse-JBeret
zh_cn: 扩展标题Quarkiverse-JBeret

source: Extension Version
zh_cn: 扩展版本

source: Extension Version: 1.1.1
zh_cn: 扩展版本: 1.1.1

source: Extension or Dependency
zh_cn: 扩展或依赖性

source: Extensions
zh_cn: 扩展

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
zh_cn: 扩展在进入Quarkus生态系统时具有不同程度的成熟度。状态提供了你可以依赖的期望。

source: External and Internal Access to OpenID Connect Provider
zh_cn: 外部和内部访问OpenID Connect的提供者

source: External application.yaml file
zh_cn: 外部application.yaml 文件

source: Extra Build Generated Files
zh_cn: 构建额外生成的文件

source: Extracting Content with Apache Tika
zh_cn: 用Apache Tika提取内容

source: Failure Management
zh_cn: 失败管理

source: Feedback and Help
zh_cn: 反馈和帮助

source: Filter the Extensions
zh_cn: 筛选扩展程序

source: Final touch, the HTML page reading the converted prices using SSE.
zh_cn: 最后，HTML页面使用SSE读取转换后的价格。

source: Finally, Secured Access to /secured/roles-allowed
zh_cn: 最后，安全访问/secured/roles-allowed

source: Finally, configure your channels to use the JSON-B serializer and deserializer.
zh_cn: 最后，通过配置来使您的 channels 使用JSON-B串行器和反串行器。

source: Finally, configure your channels to use the Jackson serializer and deserializer.
zh_cn: 最后，配置您的 channelss 以使用Jackson序列化器和反序列化器。

source: Finally, if port 8080 or port 8081 is not available on your computer, you can modify the dev and test mode ports with application.properties
zh_cn: 最后，如果端口8080或端口8081在你的电脑上不可用，你可以使用application.properties修改开发和测试模式的端口

source: Finally, if you declare
zh_cn: 最后，如果您声明

source: Finally, there is one specific thing for AWS Gateway REST API deployments. That API assumes that HTTP response bodies are text unless you explicitly tell it which media types are binary through configuration. To make things easier, the Quarkus extension forces a binary (base 64) encoding of all HTTP response messages and the `sam.yaml` file must configure the API Gateway to assume all media types are binary:
zh_cn: 最后，对于AWS Gateway REST API的部署，有一件特别的事情。该API假定HTTP响应体是文本，除非你通过配置明确告诉它哪些媒体类型是二进制。为了使事情更简单，Quarkus扩展强制对所有的HTTP响应信息进行二进制（base 64）编码， `sam.yaml` 文件必须配置API网关，以假设所有的媒体类型都是二进制：

source: Finally, when getting the `MongoCollection` from the database you can use directly the `Fruit` class instead of the `Document` one, the codec will automatically map the `Document` to/from your `Fruit` class.
zh_cn: 最后，当从数据库中获取 `MongoCollection` 时，你可以直接使用 `Fruit` 类，而不是 `Document` ，编解码器会自动将 `Document` 与 `Fruit` 类相互映射（从 `Fruit` 类映射 `Document` 或者将 `Document` 映射到 `Fruit` 类）。

source: Finally, write your test which will be executed in JVM mode:
zh_cn: 最后编写你的测试，它将在JVM模式下执行：

source: First compile it:
zh_cn: 首先编译它：

source: First declare your service as follows:
zh_cn: 首先声明你的服务如下：

source: First let's define a few `QuarkusTestProfile` implementations like so:
zh_cn: 首先让我们定义这么几个 `QuarkusTestProfile` 实现：

source: First you need to add the following dependency:
zh_cn: 首先，你需要添加以下依赖关系：

source: First you need to create a Bson `Codec` that will tell Bson how to transform your entity to/from a MongoDB `Document`. Here we use a `CollectibleCodec` as our object is retrievable from the database (it has a MongoDB identifier), if not we would have used a `Codec` instead. More information in the codec documentation: https://mongodb.github.io/mongo-java-driver/3.10/bson/codecs.
zh_cn: 首先你需要创建一个Bson `Codec` ，它将告诉Bson如何将你的实体与MongoDB `Document` 的相互转化。这里我们使用一个 `CollectibleCodec` ，因为我们的对象可以从数据库中检索到（它有一个MongoDB标识符），如果不是这样，我们会使用一个 `Codec` 。更多信息见编解码器文档 https://mongodb.github.io/mongo-java-driver/3.10/bson/codecs

source: First, add the following test dependency to your application:
zh_cn: 首先，在您的应用程序中添加以下测试依赖：

source: First, create a `GreetingResource` JAX-RS resource in the `src/main/java/org/acme/spring/boot/properties/GreetingResource.java` file that looks like:
zh_cn: 首先，在 `src/main/java/org/acme/spring/boot/properties/GreetingResource.java` 文件中创建一个包含如下内容的 `GreetingResource` JAX-RS资源:

source: First, create a simple `GreetingResource` JAX-RS resource in the `src/main/java/org/acme/spring/cloud/config/client/GreetingResource.java` file that looks like:
zh_cn: 首先，在 `src/main/java/org/acme/spring/cloud/config/client/GreetingResource.java` 文件中创建一个简单的包含以下内容的 `GreetingResource` JAX-RS资源:

source: First, download https://www.gutenberg.org/files/2600/2600-0.txt[War and Peace] and store it in `src/main/resources/book.txt`. It's a 3.2 Mb file, which, while not being huge, illustrates the purpose of streams. This time, we will not accumulate the file's content in memory and write it in one batch, but read it chunk by chunk and write these chunks into the HTTP response one by one.
zh_cn: 首先，下载 link:https://www.gutenberg.org/files/2600/2600-0.txt[《战争与和平] 》，并将其存储在 `src/main/resources/book.txt` 。这是一个3.2Mb的文件，虽然不是很大，但说明了流的用途。这一次，我们将不会把文件的内容堆积在内存中并一次性写入，而是逐块读取，并把这些块逐一写入到HTTP响应中。

source: First, go to https://code.quarkus.io[code.quarkus.io] and select the following extensions:
zh_cn: 首先，访问 https://code.quarkus.io[code.quarkus.io] 并选择以下扩展：

source: First, include one of the RESTEasy Reactive extensions to enable JAX-RS endpoints, for example, add the `io.quarkus:quarkus-resteasy-reactive-jackson` dependency for JAX-RS and JSON support.
zh_cn: 首先，请添加任意一个RESTEasy Reactive扩展的依赖，以启用JAX-RS端点，例如，添加支持JAX-RS和JSON的 `io.quarkus:quarkus-resteasy-reactive-jackson` 依赖。

source: First, include one of the RESTEasy extensions to enable JAX-RS endpoints, for example, add the `io.quarkus:quarkus-resteasy-reactive-jackson` dependency for JAX-RS and JSON support.
zh_cn: 首先，包括RESTEasy的一个扩展，以启用JAX-RS端点，例如，添加 `io.quarkus:quarkus-resteasy-reactive-jackson` 依赖来支持JAX-RS和JSON。

source: First, let's create the `Fruit` bean as follows:
zh_cn: 首先，让我们创建 `Fruit` 实体类，如下所示：

source: First, let's start the GraalVM container, noting the container id output.
zh_cn: 首先，让我们启动GraalVM容器，注意容器ID的输出。

source: First, libsunec.so, the C library used for the SSL implementation:
zh_cn: 首先是libsunec.so，用于SSL实现的C库：

source: First, make sure you stopped the applications, and build both applications in JVM mode with:
zh_cn: 首先，确保你停止了应用程序，并在JVM模式下使用以下命令构建这两个应用程序：

source: First, we need a new Kotlin project. This can be done using the following command:
zh_cn: 首先，我们需要一个新的Kotlin项目。这可以通过以下命令来完成：

source: First, we need a new project. Create a new project with the following command:
zh_cn: 首先，我们需要一个新的项目。使用以下命令创建一个新项目:

source: First, we need to create an instance of `WebClient`. Extend the `VertxResource` class with the `client` field and the creation of the web client in the constructor:
zh_cn: 首先，我们需要创建一个 `WebClient` 的实例。使用 client 字段扩展 `VertxResource` 类并在构造函数中创建 Web 客户端:

source: First, we need to create two projects: the _producer_ and the _processor_.
zh_cn: 首先，我们需要创建两个项目： _producer_ 和 _processor_ 。

source: First, we will need to package it:
zh_cn: 首先，需要打包：

source: First, you can consume messages from various brokers such as AMQP or Apache Kafka, and process these messages smoothly:
zh_cn: 首先，你可以从AMQP或Apache Kafka等各种代理那里消费消息，并顺利地处理这些消息。

source: First, you can create a BSON Codec which will be automatically registered by Quarkus and will be used instead of the `PojoCodecProvider`. See this part of the documentation: xref:mongodb.adoc#simplifying-mongodb-client-usage-using-bson-codec[Using BSON codec].
zh_cn: 首先，你可以创建一个BSON编解码器，它将被Quarkus自动注册，并代替 `PojoCodecProvider` 。见这部分文档。 link:mongodb.html#simplifying-mongodb-client-usage-using-bson-codec[使用BSON编解码器] 。

source: First, you need to include the `quarkus-jsonb` extension.
zh_cn: 首先，您需要引入 `quarkus-jsonb` 扩展。

source: First-Class Support for GraalVM Native Images
zh_cn: 优秀的对GraalVM原生镜像支持

source: First: Locking using findById().
zh_cn: 第一：通过findById()方法使用数据库锁。

source: First: an example
zh_cn: 第一：一个例子

source: Flyway and Hibernate ORM
zh_cn: Flyway和Hibernate ORM

source: Flyway support relies on the Quarkus datasource config. It can be customized for the default datasource as well as for every <<multiple-datasources,named datasource>>. First, you need to add the datasource config to the `{config-file}` file in order to allow Flyway to manage the schema. Also, you can customize the Flyway behaviour by using the following properties:
zh_cn: Flyway支持依赖于Quarkus的数据源配置。它可以为默认的数据源以及每个 link:#multiple-datasources[命名的数据源] 进行定制。首先，你需要将数据源配置添加到 `{config-file}` 文件中，以便让Flyway管理数据库模型。另外，你可以根据以下属性来设置Flyway。

source: Follow Quarkus on Twitter
zh_cn: 在Twitter上关注Quarkus

source: Follow the xref:hibernate-orm.adoc#setting-up-and-configuring-hibernate-orm[Hibernate set-up guide for all configuration].
zh_cn: 按照 link:hibernate-orm.html#setting-up-and-configuring-hibernate-orm[Hibernate 设置指南] 进行其他配置。

source: Following the same approach as described in the previous section, JSON-B can be configured using a `io.quarkus.jsonb.JsonbConfigCustomizer` bean.
zh_cn: 按照上一节所述的相同方法，JSON-B可以使用 `io.quarkus.jsonb.JsonbConfigCustomizer` bean进行配置。

source: Following the same ideas, you can implement the other CRUD methods.
zh_cn: 遵循相同的思路，您可以实现其他CRUD方法。

source: Following types can be injected as channels:
zh_cn: 以下类型可以作为 channels 被注入：

source: For Confluent Schema Registry serde, that is:
zh_cn: 对于Confluent Schema Registry serde来说，就是：

source: For Docker:
zh_cn: 对于Docker：

source: For Gradle projects please <<gradle,see below>>, or for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
zh_cn: 对于Gradle项目，请 link:#gradle[见下文] ，或进一步参考 link:gradle-tooling.html[Gradle设置页面]中 的指南。

source: For HTTP, the important method to override is `LambdaIdentityProvider.authenticate(APIGatewayV2HTTPEvent event)`. From this you will allocate a SecurityIdentity based on how you want to map security data from `APIGatewayV2HTTPEvent`
zh_cn: 对于HTTP，要覆盖的重要方法是 `LambdaIdentityProvider.authenticate(APIGatewayV2HTTPEvent event)` 。为此，你将根据你从 `APIGatewayV2HTTPEvent` 映射安全数据的方式来分配一个SecurityIdentity

source: For Kafka producer client serialization failures are not recoverable, thus the message dispatch is not retried. In these cases you may need to apply a failure strategy for the serializer. To achieve this, you need to create a bean implementing `SerializationFailureHandler<T>` interface:
zh_cn: 对于Kafka生产者客户端来说序列化失败是不可恢复的，因此消息发送不会被重试。在这些情况下，您可能需要为序列化器设置一个失败策略。为了实现这一点，您需要一个实现了 `SerializationFailureHandler<T>` 接口的bean：

source: For Linux & MacOS users
zh_cn: 针对Linux和MacOS用户

source: For Linux hosts, execute:
zh_cn: 对于Linux主机，执行。

source: For Linux, macOS, and Windows (using WSL or bash compatible shell like Cygwin or MinGW)
zh_cn: 对于Linux、macOS和Windows（使用WSL或bash兼容的shell，如Cygwin或MinGW）

source: For Maven, add the following to your `pom.xml`.
zh_cn: 对于Maven，在你的 `pom.xml` 中添加以下内容。

source: For MongoDB with Panache, you could use the `@MongoEntity` annotation on your data class for this:
zh_cn: 对于带有Panache的MongoDB，你可以在你的数据类上使用 `@MongoEntity` 注解来实现这一点。

source: For REST, the important method to override is `LambdaIdentityProvider.authenticate(AwsProxyRequest event)`. From this you will allocate a SecurityIdentity based on how you want to map security data from `AwsProxyRequest`.
zh_cn: 对于REST，要覆盖的重要方法是 `LambdaIdentityProvider.authenticate(AwsProxyRequest event)` 。为此，你将根据你从 `AwsProxyRequest` 映射安全数据的方式来分配一个SecurityIdentity。

source: For Strimzi, you can select any image with a Kafka version which has Kraft support (2.8.1 and higher) from https://quay.io/repository/strimzi-test-container/test-container?tab=tags
zh_cn: 对于Strimzi，您可以从 https://quay.io/repository/strimzi-test-container/test-container?tab=tags ，选择任何可以获得Kraft支持的Kafka版本（2.8.1及以上）的镜像

source: For Windows users
zh_cn: 对于Windows用户

source: For Windows using Powershell
zh_cn: 面向Windows使用Powershell

source: For `@QuarkusIntegrationTest` tests that result in launcher the application as a container, `io.quarkus.test.common.DevServicesContext` also provides access to the id of the container network on which the application container was launched (via the `containerNetworkId` method). This can be used by `QuarkusTestResourceLifecycleManager` that need to launch additional containers that the application will communicate with.
zh_cn: 对于将应用程序作为容器启动的 `@QuarkusIntegrationTest` 测试，`io.quarkus.test.common.DevServicesContext` 也提供了对应用容器所启动的容器网络id的访问(通过 `containerNetworkId` 方法)。这可以被 `QuarkusTestResourceLifecycleManager` 使用来启动一些应用程序需要通信的其他容器。

source: For a full list of possible statuses, check our https://quarkus.io/faq/#extension-status[FAQ entry].
zh_cn: 想要了解完整的扩展状态信息，请查看 https://quarkus.io/faq/#extension-status[常见问题入口] 。

source: For a given application instance, the number of consumers inside the consumer group can be configured using `mp.messaging.incoming.$channel.partitions` property. The partitions of the subscribed topic will be divided among the consumer threads. Note that if the `partitions` value exceed the number of partitions of the topic, some consumer threads won't be assigned any partitions.
zh_cn: 对于一个给定的应用程序实例，消费者组内的消费者数量可以使用 `mp.messaging.incoming.$channel.partitions` 进行配置。被订阅的topic中的分区将会在所有的消费者线程间进行分配。请注意，如果 `partitions` 值超过topic本身的分区数量，那么某些消费者线程将得不到分区分配。

source: For a more detailed guide about debugging native images please refer to the xref:native-reference.adoc[Native Reference Guide].
zh_cn: 关于调试原生镜像的更详细指南，请参考 xref:native-reference.adoc[原生参考指南] 。

source: For a regular JVM distribution you need to base your image off the official AWS Java base images. Below is an example of a Dockerfile that would create a container image from your Quarkus Lambda project. It assumes that `mvn package` has been executed and binaries are available in the `target/` directory:
zh_cn: 对于正常的JVM发行版，你需要在官方AWS Java基础镜像之上建立你的镜像。下面是一个Dockerfile的例子，它将从你的Quarkus Lambda项目创建一个容器镜像。它假设已经执行了 `mvn package` ，并且二进制文件已存在于 `target/` 目录中：

source: For advanced configuration of the MongoDB client, you can follow the xref:mongodb.adoc#configuring-the-mongodb-database[Configuring the MongoDB database guide].
zh_cn: 对于MongoDB客户端的高级配置，你可以遵循配置 link:mongodb.html#configuring-the-mongodb-database[MongoDB数据库指南] 。

source: For applying retry mechanism on processing errors, see the section on <<retrying-processing>>.
zh_cn: 关于如何对错误处理应用重试机制，请参见 link:#retrying-processing[[重试-处理]] 一节。

source: For each call you are intending to do, add a method and use annotations to describe the behavior. You can combine the REST Client with the <a href="https://quarkus.io/guides/smallrye-fault-tolerance">fault tolerance extension</a> to handle failure gracefully. Then, in your resource, just use the <code>ElementService</code> interface:
zh_cn: 对于你打算做的每个调用，添加一个方法并使用注解来描述行为。您可以将REST客户端与<a href="https://quarkus.io/guides/smallrye-fault-tolerance">容错扩展</a>结合起来，以优雅地处理失败。然后，在你的资源中，只需使用<code>ElementService</code>接口：

source: For each channel, you can disable the checks using:
zh_cn: 对于每个 channel ，您都可以禁用检查，通过：

source: For each chunk, we produce a String
zh_cn: 对于每个块，我们生成一个字符串

source: For every authenticated resource, you can inject a `SecurityIdentity` instance to get the authenticated identity information.
zh_cn: 对于每个认证资源，您可以注入一个 `SecurityIdentity` 实例来获得认证的身份信息。

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
zh_cn: 例如，默认情况下，GraalVM中的反射将不能工作，除非类/成员已显式地为反射注册。这通常是通过列出JSON文件中的每个类、方法、字段和构造函数，并将其作为参数传递到原生镜像构建中实现的。显然，除了最简易的项目外，这对于所有项目来说都是相当麻烦的。Quarkus提供了一个框架，可以轻松地处理这些注解，并以编程的方式确定应该注册哪些内容。

source: For example, The following code illustrates how you can store incoming payloads to a database using Hibernate with Panache:
zh_cn: 例如，下面的代码演示了如何使用Hibernate与Panache将接收到的payload存储到数据库：

source: For example, here is how you can use `keycloak.js` to authenticate the users and refresh the expired tokens from the SPA:
zh_cn: 例如，以下是你如何使用 `keycloak.js` 来验证用户并从SPA中刷新过期的令牌：

source: For example, if you declare
zh_cn: 例如，如果您声明

source: For example, if you need to send a message to a stream when receiving a POST request inside a REST endpoint. In this case, you cannot use `@Outgoing` because your method has parameters.
zh_cn: 例如，如果您需要在REST节点内收到一个POST请求时向一个流发送消息。在这种情况下，您无法使用 `@Outgoing` ，因为您的方法有参数。

source: For example, if your OpenID Connect provider sets a token audience then the following configuration pattern is recommended:
zh_cn: 例如，如果你的OpenID Connect提供商设置了一个令牌受众，那么建议采用以下配置模式：

source: For example, this defines the `@WithKubernetesTestServer` annotation, which you can use on your tests to activate the `KubernetesServerTestResource`, but only for the annotated test class. You can also place them on your `QuarkusTestProfile` test profiles.
zh_cn: 例如，下面代码定义了 `@WithKubernetesTestServer` 注释，您可以在您的测试上使用它来激活 `KubernetesServerTestResource` ，但只针对被注释的测试类。您也可以把它们加入到您的 `QuarkusTestProfile` 测试profile中。

source: For example, to configure the `max.block.ms` property, use:
zh_cn: 例如，要配置 `max.block.ms` 属性，可以使用：

source: For example, to configure the `max.poll.records` property, use:
zh_cn: 例如，要配置 `max.poll.records` 属性，可以使用：

source: For example, you can send to a dynamic address based on the incoming message:
zh_cn: 例如，你可以根据传入的消息发送至一个动态地址。

source: For example, you can use Docker to run your database:
zh_cn: 例如，你可以使用Docker来运行你的数据库：

source: For example:
zh_cn: 例如：
